app/views/artworks/new.erb

SELECT "tags".* FROM "tags" WHERE "tags"."category" = ?  [["category", "style"]]
---
          <option value="">Select Style</option>
        <% Tag.where(category: "style").each do |style_tag| %>