app/views/artworks/show.erb

SELECT "tags".* FROM "tags" INNER JOIN "artwork_tags" ON "tags"."id" = "artwork_tags"."tag_id" WHERE "artwork_tags"."artwork_id" = ?  [["artwork_id", 1]]
---
Tags:
<%= @artwork.c_tag.reject { |c| c.name.empty? }.map {|tag| link_to tag.name.capitalize, tag}.join(", ").html_safe %><br><br>