app/views/users/show.erb


<% if !@user.artworks.empty? %>
---
SELECT  1 AS one FROM "artworks" WHERE "artworks"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."user_id" = ?  [["user_id", 1]]