app/views/tags/show.erb

SELECT  1 AS one FROM "artworks" INNER JOIN "artwork_tags" ON "artworks"."id" = "artwork_tags"."artwork_id" WHERE "artwork_tags"."tag_id" = ? LIMIT ?  [["tag_id", 15], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_tags" ON "artworks"."id" = "artwork_tags"."artwork_id" WHERE "artwork_tags"."tag_id" = ?  [["tag_id", 15]]
---

<% if !@tag.artworks.empty? %>