app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE (name LIKE '%%')
---
  def index
    @artworks = Artwork.search(params[:search])

SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = ?  [["artwork_id", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."artwork_id" = ?  [["artwork_id", 1]]
---
  def show
    @comments = Comment.all.where(artwork_id: params[:id])
    @comment = Comment.new
    @votes = Vote.all.where(artwork_id: params[:id])

SELECT "tags".* FROM "tags" WHERE "tags"."category" = ?  [["category", "style"]]
---
  def new
    @artwork = Artwork.new
    @styles = Tag.where(category: "style")

INSERT INTO "artworks" ("name", "user_id", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?)  [["name", "dafgdf"], ["user_id", 9], ["created_at", "2018-03-08 15:23:25.976360"], ["updated_at", "2018-03-08 15:23:25.976360"], ["image", "Screen_Shot_2018-02-27_at_2.29.04_PM.png"]]
INSERT INTO "tags" ("name", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "lksjdfl"], ["category", "year"], ["created_at", "2018-03-08 15:17:47.558912"], ["updated_at", "2018-03-08 15:17:47.558912"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."category" = ? AND "tags"."name" = ? LIMIT ?  [["category", "year"], ["name", "lksjdfl"], ["LIMIT", 1]]
INSERT INTO "artwork_tags" ("artwork_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["artwork_id", 30], ["tag_id", 34], ["created_at", "2018-03-08 15:17:47.586448"], ["updated_at", "2018-03-08 15:17:47.586448"]]
---
  def create
    byebug
    @artwork = Artwork.new(artwork_params)
    @artwork.user_id = session[:user_id]
    if @artwork.save
      @year_tag = Tag.find_or_create_by(category: "year", name: params[:artwork][:year])
      ArtworkTag.create(artwork_id: @artwork.id, tag_id: @year_tag.id)