app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "artwork_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", ""], ["user_id", 10], ["artwork_id", 1], ["created_at", "2018-03-08 23:05:41.728463"], ["updated_at", "2018-03-08 23:05:41.728463"]]
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]
---
  def destroy
    @comment = Comment.find(params[:comment_id])
    @comment.destroy