app/controllers/searches_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."category" = ?  [["category", "style"]]
---
  def new
    @search = Search.new
    @styles = Tag.where(category: :style).uniq