app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "lkim"], ["LIMIT", 1]]
---
  def create
    if params[:password] || params[:password] != ""
      @user = User.find_by(username: params[:username])