app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["bio", "I'm Gil. This is my page. I'm going to critique you."], ["updated_at", "2018-03-08 21:30:11.982772"], ["id", 11]]
---
  def update
    if @user.update(user_params)