app/controllers/votes_controller.rb

SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."artwork_id" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
 def like
   @vote = Vote.find_or_create_by(user_id: session[:user_id], artwork_id: params[:artwork_id])

SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."artwork_id" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
 def dislike
   @vote = Vote.find_or_create_by(user_id: session[:user_id], artwork_id: params[:artwork_id])